europe = {'Нидерландия': 'Амстердам', 'Андора': 'Андора ла Веля', 'Гърция': 'Атина',
          'Сърбия':'Белград', 'Германия': 'Берлин', 'Швейцария': 'Берн',
          'Словакия': 'Братислава', 'Белгия': 'Брюксел', 'Унгария': 'Будапеща',
          'Румъния': 'Букурещ', 'Лихтенщайн': 'Вадуц', 'Малта': 'Валета',
          'Полша': 'Варшава', 'Ватикан': 'Ватикан', 'Австрия': 'Виена',
          'Литва': 'Вилнюс', 'Ирландия': 'Дъблин', 'Хърватия': 'Загреб',
          'Украйна': 'Киев', 'Молдова': 'Кишинев', 'Дания': 'Копенхаген',
          'Португалия': 'Лисабон', 'Великобритания': 'Лондон', 'Словения': 'Любляна',
          'Люксембург': 'Люксембург', 'Испания': 'Мадрид', 'Беларус': 'Минск',
          'Монако': 'Монако', 'Русия': 'Москва', 'Норвегия': 'Осло',
          'Франция': 'Париж', 'Черна гора': 'Подгорица', 'Чехия': 'Прага',
          'Исландия': 'Рейкявик', 'Латвия': 'Рига', 'Италия': 'Рим',
          'Сан Марино': 'Сан Марино', 'Босна и Херцеговина': 'Сараево',
          'Северна Македония': 'Скопие', 'България': 'София', 'Швеция': 'Стокхолм',
          'Естония': 'Талин', 'Албания': 'Тирана', 'Финландия': 'Хелзинки',
          'Донецка народна република': 'Донецк', 'Луганска народна република': 'Луганск',
          'Косово': 'Прищина', 'Приднестровие': 'Тираспол'}

asia = {'Обединени арабски емирства': 'АбуДаби', 'Йордания': 'Аман', 'Турция': 'Анкара',
        'Туркменистан': 'Ашхабад', 'Ирак': 'Багдад', 'Азербайджан': 'Баку',
        'Тайланд': 'Бангкок', 'Бруней': 'Бандар Сери Бегаван', 'Ливан': 'Бейрут',
        'Киргизстан': 'Бишкек', 'Лаос': 'Виентян', 'Бангладеш': 'Дака',
        'Сирия': 'Дамаск', 'Индия': 'Ню Делхи', 'Индонезия': 'Джакарта',
        'ИзточенТимор': 'Дили', 'Катар': 'Доха', 'Таджикистан': 'Душанбе',
        'Армения': 'Ереван', 'Израел': 'Йерусалим', 'Пакистан': 'Исламабад',
        'Афганистан': 'Кабул', 'Непал': 'Катманду', 'Малайзия': 'Куала Лумпур',
        'Малдиви': 'Мале', 'Бахрейн': 'Манама', 'Филипини': 'Манила', 'Оман': 'Маскат',
        'Мианмар': 'Найпидо', 'Кипър': 'Никозия', 'Казахстан': 'Нур Султан',
        'Китай': 'Пекин', 'Камбоджа': 'Пном Пен', 'Северна Корея': 'Пхенян',
        'Йемен': 'Сана', 'Южна Корея': 'Сеул', 'Сингапур': 'Сингапур',
        'Узбекистан': 'Ташкент', 'Грузия': 'Тбилиси', 'Иран': 'Техеран',
        'Япония': 'Токио', 'Бутан': 'Тхимпху', 'Монголия': 'Улан Батор',
        'Виетнам': 'Ханой', 'Шри Ланка': 'Шри Джаяварданапура Коте', 'Кувейт': 'Кувейт',
        'Саудитска Арабия': 'Рияд', 'Северен Кипър': 'Никозия',
        'Държава Палестина': 'Рамала', 'Нагорни Карабах': 'Степанакерт',
        'Абхазия': 'Сухуми', 'Тайван': 'Тайпе', 'Южна Осетия': 'Цхинвали'}

africa = {'Нигерия': 'Абуджа', 'Етиопия': 'Адис Абеба', 'Гана': 'Акра', 'Алжир': 'Алжир',
          'Мадагаскар': 'Антананариву', 'Еритрея': 'Асмара', 'Мали': 'Бамако',
          'Централноафриканска република': 'Банги', 'Гамбия': 'Банджул',
          'Гвинея-Бисау': 'Бисау', 'Република Конго': 'Бразавил', 'Сейшели': 'Виктория',
          'Намибия': 'Виндхук', 'Ботсвана': 'Габороне', 'Бурунди': 'Гитега',
          'Сенегал': 'Дакар', 'Джибути': 'Джибути', 'Южен Судан': 'Джуба',
          'Танзания': 'Додома', 'Египет': 'Кайро', 'Уганда': 'Кампала',
          'Руанда': 'Кигали', 'Демократична република Конго': 'Киншаса',
          'Гвинея': 'Конакри', 'Габон': 'Либревил', 'Малави': 'Лилонгве', 'Того': 'Ломе',
          'Ангола': 'Луанда', 'Замбия': 'Лусака', 'Екваториална Гвинея': 'Малабо',
          'Мозамбик': 'Мапуто', 'Лесото': 'Масеру', 'Есватини': 'Мбабане',
          'Сомалия': 'Могадишу', 'Либерия': 'Монровия', 'Коморски острови': 'Морони',
          'Кения': 'Найроби', 'Чад': 'Нджамена', 'Нигер': 'Ниамей',
          'Мавритания': 'Нуакшот', 'Мавриций': 'Порт Луи', 'Бенин': 'Порто Ново',
          'Кабо Верде': 'Прая', 'ЮАР': 'Претория', 'Мароко': 'Рабат',
          'Сао Томе и Принсипи': 'Сао Томе', 'Либия': 'Триполи', 'Тунис': 'Тунис',
          'Буркина Фасо': 'Уагадугу', 'Сиера Леоне': 'Фрийтаун', 'Зимбабве': 'Хараре',
          'Судан': 'Хартум', 'Кот дИвоар': 'Ямусукро', 'Камерун': 'Яунде',
          'Сомалиленд': 'Харгейса', 'Западна Сахара': 'Аюн'}

america = {'Парагвай': 'Асунсион', 'Сейнт Китси Невис': 'Бастер', 'Белиз': 'Белмопан',
           'Колумбия': 'Богота', 'Бразилия': 'Бразилия', 'Барбадос': 'Бриджтаун',
           'Аржентина': 'Буенос Айрес', 'САЩ': 'Вашингтон', 'Куба': 'Хавана',
           'Гватемала': 'Гватемала', 'Гвиана': 'Джорджтаун', 'Венецуела': 'Каракас',
           'Сейнт Лусия': 'Кастрийс', 'Сейнт Винсент и Гренадини': 'Кингстаун',
           'Ямайка': 'Кингстън', 'Еквадор': 'Кито', 'Перу': 'Лима',
           'Никарагуа': 'Манагуа', 'Мексико': 'Мексико', 'Уругвай': 'Монтевидео',
           'Бахамски острови': 'Насау', 'Канада': 'Отава', 'Панама': 'Панама',
           'Суринам': 'Парамарибо', 'Хаити': 'Порто Пренс', 'Тринидад и Тобаго': 'Порт ъф Спейн',
           'Доминика': 'Розо', 'Салвадор': 'Сан Салвадор', 'Коста Рика': 'Сан Хосе',
           'Доминиканска република': 'Санто Доминго', 'Чили': 'Сантяго',
           'Антигуа и Барбуда': 'Сейнт Джонс', 'Гренада': 'Сейнт Джорджис', 'Боливия': 'Сукре',
           'Хондурас': 'Тегусигалпа'}

oceania = {'Самоа': 'Апия', 'Нова Зеландия': 'Уелингтън', 'Австралия': 'Канбера',
           'Маршалови острови': 'Маджуро', 'Палау': 'Нгерулмуд', 'Тонга': 'Нукуалофа',
           'Микронезия': 'Паликир', 'Вануату': 'Порт Вила', 'Папуа Нова Гвинея': 'Порт Морсби',
           'Фиджи': 'Сува', 'Тувалу': 'Фунафути', 'Соломонови острови': 'Хониара',
           'Кирибати': 'Южна Тарауа', 'Науру': 'Няма официална столица'}

# import re  # Used to extract capitals and countries from some text.
# text = """  """
# matches = []
# for m in re.findall("[А-Я][А-Яа-я]+",text):
#     matches.append(m)
# dict_matches = {}
# for i in range(0, len(matches), 2):
#     dict_matches[matches[i]] = matches[i + 1]
# print(dict_matches)
